a=float(input()) / 100 #рост в сантиметрах
b=float(input()) #вес в кг
c = b/(a**2) #индекс массы тела
if c<16:
    print("выраженный дефицит массы тела")
elif c>=16 and c<=18.49:
    print("недостаточная масса тела")
elif c>=18.5 and c<=24.99:
    print("норма")
elif c>=25 and c<=29.99:
    print("избыточная масса тела")
elif c>=30 and c<=34.99:
    print("ожирение первой степени")
elif c>=35 and c<=39.99:
    print("ожирение второй степени")
else:
    print("ожирение третьей степени")
