n = int(input("введите число до 200: "))

if n <= 10:
    print(n - 1)
elif n <= 190:
    i = n - 11 #позиция относительно начала двузначных чисел
    x = 10 + i // 2 #определение двузначного числа где находится цифра
    d = i % 2 #определение нужной цифры
    if d == 0:
        print(x // 10)
    else:
        print(x % 10)
else:
    i = n - 191
    x = 100 + i // 3
    d = i % 3
    if d == 0:
        print(x // 100)
    elif d == 1:
        print((x // 10) % 10)
    else:
        print(x % 10)