print("Здравствуйте! Как Вас зовут?", end="")
name = input().split()
print("Очень приятно, {name}! Меня зовут Марк")
print("Сколько вам лет?", end="")
age = input().split()

#в 2026 году компьютеру марк-1 исполнилось 2026-1944=82 года
mark_age=82
diff=mark_age-age

if mark_age >= age:
    print("да, {name}, я старше вас на {diff} лет.")
else:
    print("да, {name}, вы старше меня на {diff} лет.")

print("Вам нравится программировать?", end="")
answer = input().strip().lower()

if answer == "да":
    print("Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ. ")
else:
    print("Жаль. Я думал, Вы сможете написать интересную программу для меня.")
