a = input("Собака короткошерстной породы? ")
if a == "да":
    b = input("Рост собаки менее 50 см? ")
    if b == "да":
        c = input("У собаки короткий хвост? ")
        if c == "да":
            print("английский бульдог")
        else:
            d = input("У собаки длинные уши? ")
            if d == "да":
                print("гончая")
            else:
                e = input("У собаки короткое тело? ")
                if e == "да":
                    print("мопс")
                else:
                    print("чихуахуа")
    else:
        c = input("Собака весит более 50 кг? ")
        if c == "да":
            print("датский дог")
        else:
            print("фоксхаунд")
else:
    b = input("Рост собаки менее 50 см? ")
    if b == "да":
        c = input("У собаки доброжелательный характер? ")
        if c == "да":
            print("кокер-спаниэль")
        else:
            print("ирландский сеттер")
    else:
        c = input("У собаки рост менее 70 см? ")
        if c == "да":
            d = input("У собаки длинные уши? ")
            if d == "да":
                print("большой вандейский гриффон")
            else:
                print("колли")
        else:
            d = input("Окрас рыжий с белыми отметинами? ")
            if d == "да":
                print("сенбернар")
            else:
                e = input("Белоснежный окрас? ")
                if e == "да":
                    print("ирландский волкодав")
                else:
                    print("ньюфаундленд")